In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel('./tsp_(중구, 23, 6-10).xlsx', sheet_name='k=5')
df

  cluster  number                             tsp route  distance
0       A       5                      1, 3, 2, 4, 5, 1  3.088498
1       B       4                         1, 2, 3, 4, 1  3.513502
2       C      11  1, 8, 7, 6, 10, 9, 11, 3, 4, 2, 5, 1  3.575121
3       D       6                   1, 2, 5, 3, 4, 6, 1  2.209753
4       E      10      1, 4, 5, 3, 7, 9, 10, 6, 8, 2, 1  4.232430

In [3]:
#n : cluster 내 대여소 갯수
for i in range(len(df)):
    n=df.iloc[i, 1]
    d=df.iloc[i, 3]
    if n>=10:
        비용1=(d/6.8)*1332.74 + 23013.75*4 + 51450000/(16.8*365*2)
        df.loc[i,'truck type']='2.5t'
        df.loc[i, 'cost']=비용1
    else: 
        비용2=(d/8.5)*1332.74 + 23013.75*4 + 18375000/(16.8*365*2)
        df.loc[i,'truck type']='1.0t'
        df.loc[i, 'cost']=비용2
df

,cluster,number,tsp route,distance,truck type,cost
0,A,5,"1, 3, 2, 4, 5, 1",3.088498,1.0t,94037.542364
1,B,4,"1, 2, 3, 4, 1",3.513502,1.0t,94104.180008
2,C,11,"1, 8, 7, 6, 10, 9, 11, 3, 4, 2, 5, 1",3.575121,2.5t,96950.897559
3,D,6,"1, 2, 5, 3, 4, 6, 1",2.209753,1.0t,93899.761302
4,E,10,"1, 4, 5, 3, 7, 9, 10, 6, 8, 2, 1",4.232430,2.5t,97079.724504

In [4]:
#total distance
a=0
for i in range(len(df)):
    a+=df.loc[i, 'distance']
a

16.61930393108225

In [5]:
#total cost
b=0
for i in range(len(df)):
    b+=df.loc[i, 'cost']
b

476072.10573696706